# Exercises: Working with Databases in Python

For the exercises, we will be practicing the steps outlined in this [article](https://towardsdatascience.com/do-you-know-python-has-a-built-in-database-d553989c87bd). You can skip the portion where the author downloads a separate SQL client to examine the database.

## Import Libraries

We will need `pandas` and `sqlite3`. SQLite is a small, self-contained database engine that comes with Python so you will not have to do any additional installations for this lesson. If you want to connect to a different database engine, such as SQL server, you may need additional libraries such as `sqlalchemy` or `pyodbc` and a tool called a driver which helps to connect a database to an application.

In [3]:
# Import sqlite3 and pandas.
import sqlite3 as sl
import pandas as pd

## Create a Database

In the article, the author shows how to use `sqlite3` to open a connection to an existing database or create a new one. Use this method to make a new database called `exercises.db`.

## Create a Connection to DB

In [4]:
# Create a new database called exercises.db.
con = sl.connect ('exercises.db')

## Create a Table

Follow the steps in the article to create a table called `favorite_books.db`. This table should include columns for the title, author, and a short description of why it is a favorite.

In [15]:
# Create a new table in your database.
with con:
    con.execute("""
        CREATE TABLE favorite_book1 (
            title TEXT,
            author TEXT,
            description TEXT
        )
    """)

## Insert Records

Add 3 entries to your table for your top 3 favorite books.

<span style="color: rgb(41, 41, 41); font-family: charter, Georgia, Cambria, &quot;Times New Roman&quot;, Times, serif; font-size: 20px; letter-spacing: -0.06px; background-color: rgb(255, 255, 255);">We need to define the SQL statement with question marks&nbsp;</span> `?` <span style="color: rgb(41, 41, 41); font-family: charter, Georgia, Cambria, &quot;Times New Roman&quot;, Times, serif; font-size: 20px; letter-spacing: -0.06px; background-color: rgb(255, 255, 255);">&nbsp;as a placeholder. Then, letâ€™s create some sample data to be inserted. With the connection object, we can then insert these sample rows.</span>

In [21]:
# Add your 3 favorite books to your table.
sql = 'INSERT INTO favorite_book1 (title, author, description) values(?, ?, ?)'
data = [
    ('Harry Potter and the Deathly Hallows', 'J K Rowling', 'The dynamic trio defeat Voldemort and prove that good prevails over evil'),
    ('Many Lives Many Masters', 'Brian Weiss', 'Our existence extends way beyond the physical, we live many lives and have many chances to have different soul experiences'),
    ('The Alchemist', 'Paulo Cuelho', 'Everyone should strive to pursue and realize their personal legend. Pay attention to the omens around you and dispel the restrictions society places on us to simply be content rather than pursue our wildest dreams')
]

In [22]:
with con:
    con.executemany(sql, data)

## Query Your Table

Write a `SELECT` query to output the 3 records in your table.

In [23]:
# Write your SELECT query here.
with con:
    data = con.execute("SELECT * FROM favorite_book1")
    for row in data:
       print(row)

('Harry Potter and the Deathly Hallows', 'J K Rowling', 'The dynamic trio defeat Voldemort and prove that good prevails over evil')
('Many Lives Many Masters', 'Brian Weiss', 'Our existence extends way beyond the physical, we live many lives and have many chances to have different soul experiences')
('The Alchemist', 'Paulo Cuelho', 'Everyone should strive to pursue and realize their personal legend. Pay attention to the omens around you and dispel the restrictions society places on us to simply be content rather than pursue our wildest dreams')

In [24]:
df = pd.read_sql_query("SELECT * FROM favorite_book1", con)
df

,title,author,description
0,Harry Potter and the Deathly Hallows,J K Rowling,The dynamic trio defeat Voldemort and prove th...
1,Many Lives Many Masters,Brian Weiss,"Our existence extends way beyond the physical,..."
2,The Alchemist,Paulo Cuelho,Everyone should strive to pursue and realize t...

In [50]:
favorite_books1=pd.DataFrame({'Title':['IT', 'The Note Book', 'Harry Potter and the Deathly Hallows'],
'ID': ['21', '45', '40'],
'Author': ['Stephen King', 'Nicholas Sparks', 'J K Rowling']})

favorite_books1.to_sql('favorite_books1', con)

favorite_books1

                                  Title  ID           Author
0                                    IT  21     Stephen King
1                         The Note Book  45  Nicholas Sparks
2  Harry Potter and the Deathly Hallows  40      J K Rowling

## Create a New Table with Pandas

Create a new table called `favorite_movies` with your top 3 favorite movies. Each movie should have an id and a title. This time, use Pandas to first make a dataframe and then write the dataframe to SQL. Write a `SELECT` query to confirm that the new table does have your top 3 favorite movies.

In [61]:
# Use Pandas to make a new table in your database.
favorite_movie = pd.DataFrame({
    'movie_title': ['IT', 'The Notebook', 'Harry Potter and the Deathly Hallows'],
    'ID': ['21', '45', '40'],
    'rotten_tomato_rating': ['86%', '53%', '77%']
})

In [62]:
#Save dataframe to database
favorite_movie.to_sql('favorite_movie', con)

3

In [63]:
favorite_movie

                            movie_title  ID rotten_tomato_rating
0                                    IT  21                  86%
1                          The Notebook  45                  53%
2  Harry Potter and the Deathly Hallows  40                  77%

In [66]:
df = pd.read_sql('''
    SELECT m.movie_title, m.rotten_tomato_rating, b.author as 'book author'
    FROM favorite_movie m LEFT JOIN favorite_books1 b ON m.ID = b.ID
''', con)

df

                            movie_title rotten_tomato_rating      book author
0                                    IT                  86%     Stephen King
1                          The Notebook                  53%  Nicholas Sparks
2  Harry Potter and the Deathly Hallows                  77%      J K Rowling